RockBase-iot/esp-claw/application/edge_agent/boards/rockbase-iot/nm_cyd_c5/sdkconfig.defaults.board
# Board specific defaults for NM-CYD-C5 (ESP32-C5, 16 MB flash, 8 MB PSRAM).
# ESP32-C5 is a single-core RISC-V chip, so ESP32-S3 dual-core/OPI options do not apply.

CONFIG_IDF_TARGET="esp32c5"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: 16 MB DIO 80 MHz
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16MB.csv"

# PSRAM: 8 MB quad 80 MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TYPE_AUTO=y

# Disable unsupported or unused modules on NM-CYD-C5
CONFIG_APP_CLAW_LUA_MODULE_TOUCH=n
CONFIG_APP_CLAW_LUA_MODULE_IMU=n
CONFIG_APP_CLAW_LUA_MODULE_BQ27220=n
CONFIG_APP_CLAW_LUA_MODULE_BLE_HID=n

# USB: Serial JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
